rails-back-end/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("body", "user_id", "review_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Look at this comment"], ["user_id", 1], ["review_id", 8], ["created_at", 2016-08-31 14:29:04 UTC], ["updated_at", 2016-08-31 14:29:04 UTC]]