rails-back-end/app/controllers/movies_controller.rb

  def show
    movie = Movie.find(params[:id])
    average_rating = '%.4f' % (movie.ratings.pluck("value").sum.to_f / movie.ratings.length)
    users_who_rated = movie.ratings.pluck("user_id")
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "ratings"."value" FROM "ratings" WHERE "ratings"."movie_id" = ?  [["movie_id", 2]]
SELECT "ratings"."user_id" FROM "ratings" WHERE "ratings"."movie_id" = ?  [["movie_id", 2]]