rails-back-end/app/controllers/ratings_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "ratings" ("value", "movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["value", 5], ["movie_id", 4], ["user_id", 1], ["created_at", 2016-08-31 18:23:17 UTC], ["updated_at", 2016-08-31 18:23:17 UTC]]
SELECT "ratings"."value" FROM "ratings" WHERE "ratings"."movie_id" = ?  [["movie_id", 4]]
---
  def create
    rating = Rating.new(rating_params)
    movie = Movie.find(params[:movie_id])
    if rating.save
      new_average = '%.4f' % (movie.ratings.pluck("value").sum.to_f / movie.ratings.length)