rails-back-end/app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 2]]
---
  def index
    movie = Movie.find(params[:movie_id])
    reviews = movie.reviews
    reviews_array = []
    reviews.each do |review|

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    review = Review.find(params[:id])

INSERT INTO "reviews" ("title", "body", "movie_id", "reviewer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Hello Title"], ["body", "This is now a body"], ["movie_id", 3], ["reviewer_id", 1], ["created_at", 2016-08-30 22:31:16 UTC], ["updated_at", 2016-08-30 22:31:16 UTC]]
---
  def create
    review = Review.new(review_params)
    review_object = { reviewContent: review, comments: [] }
    if review.save