rails-back-end/app/controllers/votes_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_id", "votable_type", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["value", 1], ["votable_id", 1], ["votable_type", "Review"], ["created_at", 2016-08-31 17:34:17 UTC], ["updated_at", 2016-08-31 17:34:17 UTC], ["user_id", 6]]
---
  def upvote_review
    review = Review.find(params[:id])
    review.votes.create(value: 1, user_id: params[:user_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_id", "votable_type", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["value", -1], ["votable_id", 2], ["votable_type", "Review"], ["created_at", 2016-08-31 19:22:09 UTC], ["updated_at", 2016-08-31 19:22:09 UTC], ["user_id", 1]]
---
  def downvote_review
    review = Review.find(params[:id])
    review.votes.create(value: -1, user_id: params[:user_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_id", "votable_type", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["value", 1], ["votable_id", 1], ["votable_type", "Comment"], ["created_at", 2016-08-31 18:37:58 UTC], ["updated_at", 2016-08-31 18:37:58 UTC], ["user_id", 6]]
---
  def upvote_comment
    comment = Comment.find(params[:id])
    comment.votes.create(value: 1, user_id: params[:user_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_id", "votable_type", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["value", -1], ["votable_id", 8], ["votable_type", "Comment"], ["created_at", 2016-08-31 19:06:51 UTC], ["updated_at", 2016-08-31 19:06:51 UTC], ["user_id", 6]]
---
  def downvote_comment
    comment = Comment.find(params[:id])
    comment.votes.create(value: -1, user_id: params[:user_id])